For `azure`, the plan is showing me more than expected from the credentials renewal, I haven't applied it yet:

<details><summary>Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azapi_update_resource.encryptionathost will be created
  + resource "azapi_update_resource" "encryptionathost" {
      + body                    = {
          + properties = {}
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = "/subscriptions/1e7d5219-acbc-4495-8629-bdbb22e9b3ed/providers/Microsoft.Features/featureProviders/Microsoft.Compute/subscriptionFeatureRegistrations/encryptionathost"
      + sensitive_body          = (write-only attribute)
      + type                    = "Microsoft.Features/featureProviders/subscriptionFeatureRegistrations@2021-07-01"
    }

  # azuread_application_password.terraform_app_password["production"] must be replaced
-/+ resource "azuread_application_password" "terraform_app_password" {
      ~ end_date       = "2026-03-08T00:00:00Z" -> "2026-06-07T00:00:00Z" # forces replacement
      ~ id             = "e651c485-66cf-4f54-aaa4-8d2c895a6bc3/password/ba51a227-1772-43f1-b993-cec484e11b4c" -> (known after apply)
      ~ key_id         = "ba51a227-1772-43f1-b993-cec484e11b4c" -> (known after apply)
      ~ start_date     = "2025-12-08T09:23:54.8925811Z" -> (known after apply)
      ~ value          = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # azuread_application_password.terraform_app_password["staging"] must be replaced
-/+ resource "azuread_application_password" "terraform_app_password" {
      ~ end_date       = "2026-03-08T00:00:00Z" -> "2026-06-07T00:00:00Z" # forces replacement
      ~ id             = "f24ebfa8-c774-41ea-ba66-254ce06e71cd/password/61a54ced-b9dc-481d-b54b-39864637f042" -> (known after apply)
      ~ key_id         = "61a54ced-b9dc-481d-b54b-39864637f042" -> (known after apply)
      ~ start_date     = "2025-12-08T09:23:52.2032471Z" -> (known after apply)
      ~ value          = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.terraform_role_assignement_contributor_azurerm["production"] will be created
  + resource "azurerm_role_assignment" "terraform_role_assignement_contributor_azurerm" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b847a030-25e1-4791-ad04-9e8484d87bce"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/dff2ec18-6a8e-405c-8e45-b7df7465acf0"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.terraform_role_assignement_contributor_azurerm["staging"] will be created
  + resource "azurerm_role_assignment" "terraform_role_assignement_contributor_azurerm" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0cf969a1-836c-45c3-9290-f17a675cfc71"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/dff2ec18-6a8e-405c-8e45-b7df7465acf0"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.terraform_role_assignement_contributor_azurerm_jenkins_sponsored["production"] will be created
  + resource "azurerm_role_assignment" "terraform_role_assignement_contributor_azurerm_jenkins_sponsored" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b847a030-25e1-4791-ad04-9e8484d87bce"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/1e7d5219-acbc-4495-8629-bdbb22e9b3ed"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.terraform_role_assignement_contributor_azurerm_jenkins_sponsored["staging"] will be created
  + resource "azurerm_role_assignment" "terraform_role_assignement_contributor_azurerm_jenkins_sponsored" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0cf969a1-836c-45c3-9290-f17a675cfc71"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/1e7d5219-acbc-4495-8629-bdbb22e9b3ed"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.backends["production"].azuread_application_password.app_password must be replaced
-/+ resource "azuread_application_password" "app_password" {
      ~ end_date       = "2026-03-08T00:00:00Z" -> "2026-06-07T00:00:00Z" # forces replacement
      ~ id             = "90b28efc-ee97-4e98-9357-f28cf80d9480/password/a743b3aa-38d5-4496-8ced-fe45de6d5c22" -> (known after apply)
      ~ key_id         = "a743b3aa-38d5-4496-8ced-fe45de6d5c22" -> (known after apply)
      ~ start_date     = "2025-12-08T09:23:52.9426224Z" -> (known after apply)
      ~ value          = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # module.backends["staging"].azuread_application_password.app_password must be replaced
-/+ resource "azuread_application_password" "app_password" {
      ~ end_date       = "2026-03-08T00:00:00Z" -> "2026-06-07T00:00:00Z" # forces replacement
      ~ id             = "6ee443e8-8621-48ea-a753-38645f31a2e6/password/883a2f40-8683-4899-a1d8-95de920ba6a1" -> (known after apply)
      ~ key_id         = "883a2f40-8683-4899-a1d8-95de920ba6a1" -> (known after apply)
      ~ start_date     = "2025-12-08T09:23:53.3647665Z" -> (known after apply)
      ~ value          = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 4 to destroy.
```

</details>

It was due to a leftover terraform.state, deleting it fixed that.